# IntersectionResultArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResultArray Constructor
IntersectionResultArray Class See Also
---
Initializes a new instance of the IntersectionResultArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IntersectionResultArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IntersectionResultArray()
```

# See Also
IntersectionResultArray Class
Autodesk.Revit.DB Namespace